CyberGrandChallenge/binutils/bfd/cgc32-msp430.c
  /* The data models must be the same.  */
  if (in_attr[OFBA_MSPABI_Tag_Data_Model].i !=
      out_attr[OFBA_MSPABI_Tag_Data_Model].i)
    {
      _bfd_error_handler
	(_("error: %B uses the %s data model whereas %B uses the %s data model"),
	 ibfd, first_input_bfd,
	 data_model (in_attr[OFBA_MSPABI_Tag_Data_Model].i),
	 data_model (out_attr[OFBA_MSPABI_Tag_Data_Model].i));
      result = FALSE;
    }

  /* The small code model requires the use of the small data model.  */
  if (in_attr[OFBA_MSPABI_Tag_Code_Model].i == 1
      && out_attr[OFBA_MSPABI_Tag_Data_Model].i != 1)
    {
      _bfd_error_handler
	(_("error: %B uses the small code model but %B uses the %s data model"),
	 ibfd, first_input_bfd,
	 data_model (out_attr[OFBA_MSPABI_Tag_Data_Model].i));
      result = FALSE;
    }

  /* The large data models are only supported by the MSP430X.  */
  if (in_attr[OFBA_MSPABI_Tag_Data_Model].i > 1
      && out_attr[OFBA_MSPABI_Tag_ISA].i != 2)
    {
      _bfd_error_handler
	(_("error: %B uses the %s data model but %B only uses MSP430 instructions"),
	 ibfd, first_input_bfd,
	 data_model (in_attr[OFBA_MSPABI_Tag_Data_Model].i));
      result = FALSE;
    }
  
  return result;
}

/* Merge backend specific data from an object file to the output
   object file when linking.  */

static bfd_boolean
cgc32_msp430_merge_private_bfd_data (bfd * ibfd, bfd * obfd)
{
  /* Make sure that the machine number reflects the most
     advanced version of the MSP architecture required.  */
#define max(a,b) ((a) > (b) ? (a) : (b))
  if (bfd_get_mach (ibfd) != bfd_get_mach (obfd))
    bfd_default_set_arch_mach (obfd, bfd_get_arch (obfd),
			       max (bfd_get_mach (ibfd), bfd_get_mach (obfd)));
#undef max

  return cgc32_msp430_merge_mspabi_attributes (ibfd, obfd);
}

/* Copy backend specific data from one object module to another.  */

static bfd_boolean
cgc32_msp430_copy_private_bfd_data (bfd *ibfd, bfd *obfd)
{
  /* Copy object attributes.  */
  _bfd_cgc_copy_obj_attributes (ibfd, obfd);

  return TRUE;
}

static bfd_boolean
msp430_cgc_is_target_special_symbol (bfd *abfd, asymbol *sym)
{
  return _bfd_cgc_is_local_label_name (abfd, sym->name);
}

/* This is gross.  The MSP430 EABI says that (sec 11.5):

     "An implementation may choose to use Rel or Rela
      type relocations for other relocations."

   But it also says that:
   
     "Certain relocations are identified as Rela only. [snip]
      Where Rela is specified, an implementation must honor
      this requirement."

  There is one relocation marked as requiring RELA - R_MSP430_ABS_HI16 - but
  to keep things simple we choose to use RELA relocations throughout.  The
  problem is that the TI compiler generates REL relocations, so we have to
  be able to accept those as well.  */

#define cgc_backend_may_use_rel_p  1
#define cgc_backend_may_use_rela_p 1
#define cgc_backend_default_use_rela_p 1

#undef  cgc_backend_obj_attrs_vendor
#define cgc_backend_obj_attrs_vendor		"mspabi"
#undef  cgc_backend_obj_attrs_section
#define cgc_backend_obj_attrs_section		".MSP430.attributes"
#undef  cgc_backend_obj_attrs_section_type
#define cgc_backend_obj_attrs_section_type	SHT_MSP430_ATTRIBUTES
#define cgc_backend_section_from_shdr  		cgc32_msp430_section_from_shdr
#define cgc_backend_obj_attrs_handle_unknown 	cgc32_msp430_obj_attrs_handle_unknown
#undef  cgc_backend_obj_attrs_arg_type
#define cgc_backend_obj_attrs_arg_type		cgc32_msp430_obj_attrs_arg_type
#define bfd_cgc32_bfd_copy_private_bfd_data	cgc32_msp430_copy_private_bfd_data
#define bfd_cgc32_bfd_merge_private_bfd_data	cgc32_msp430_merge_private_bfd_data

#define CGC_ARCH		bfd_arch_msp430
#define CGC_MACHINE_CODE	EM_MSP430
#define CGC_MACHINE_ALT1	EM_MSP430_OLD
#define CGC_MAXPAGESIZE		4
#define	CGC_OSABI		CGCOSABI_STANDALONE

#define TARGET_LITTLE_SYM       bfd_cgc32_msp430_vec
#define TARGET_LITTLE_NAME	"cgc32-msp430"

#define cgc_info_to_howto	             msp430_info_to_howto_rela
#define cgc_info_to_howto_rel	             NULL
#define cgc_backend_relocate_section         cgc32_msp430_relocate_section
#define cgc_backend_check_relocs             cgc32_msp430_check_relocs
#define cgc_backend_can_gc_sections          1
#define cgc_backend_final_write_processing   bfd_cgc_msp430_final_write_processing
#define cgc_backend_object_p		     cgc32_msp430_object_p
#define cgc_backend_post_process_headers     _bfd_cgc_set_osabi
#define bfd_cgc32_bfd_relax_section	     msp430_cgc_relax_section
#define bfd_cgc32_bfd_is_target_special_symbol	msp430_cgc_is_target_special_symbol

#undef  cgc32_bed
#define cgc32_bed		cgc32_msp430_bed

#include "cgc32-target.h"

/* The TI compiler sets the OSABI field to CGCOSABI_NONE.  */
#undef  TARGET_LITTLE_SYM
#define TARGET_LITTLE_SYM       bfd_cgc32_msp430_ti_vec

#undef  cgc32_bed
#define cgc32_bed		cgc32_msp430_ti_bed

#undef	CGC_OSABI		
#define	CGC_OSABI		CGCOSABI_NONE

static const struct bfd_cgc_special_section msp430_ti_cgc_special_sections[] =
{
  /* prefix, prefix_length,        suffix_len, type,               attributes.  */
  { STRING_COMMA_LEN (".TI.symbol.alias"),  0, SHT_MSP430_SYM_ALIASES, 0 },
  { STRING_COMMA_LEN (".TI.section.flags"), 0, SHT_MSP430_SEC_FLAGS,   0 },
  { STRING_COMMA_LEN ("_TI_build_attrib"),  0, SHT_MSP430_ATTRIBUTES,  0 },
  { NULL, 0,                                0, 0,                      0 }
};

#include "cgc32-target.h"
